"""Файл для хранения русского текста для кнопок."""

main_menu = {
    "help": "🆘 Помощь 🆘",
    "2": "Сколько у меня камней?",
    "useful_information": "Полезная информация",
    "4": "⚙️Настройка профиля⚙️",
    "5": "💵Пожертвование моему создателю💸",
}

menu_help = {
    "instructions_for_use": "Инструкция по применению",
    "instructions_for_implementing_the_bot_in_the_chat": "Инструкция для подключения меня к чату",
    "basic_commands_in_the_chat": "Основные команды в чате",
}

menu_useful_information = {
    "for_new_gamers": "Для новичков",
    "how_to_log_in_to_the_game": "Как зайти в игру, если по каким-то причинам не получается зайти",
    "who_to_download_at_the_beginning": "Кого качать в начале",
    "necessary_heroes_for_events": "Кого качать для получения героев из событий?",
    "useful_links": "Полезные ссылки",
    "instructions_for_kv": "Инструкция по КВ",
    "instructions_aptechkam_kv": "Гайд по аптечкам в КВ",
    "packs_and_counterattacks": "Паки и контрпаки",
    "three_star_trials": "Испытания на 3*",
    "schemes_of_all_raids": "Схемы всех рейдов",
    "schedule_of_clan_tasks": "Расписание клановых заданий",
}

setting_profile = {
    "setting_hero": "Манипуляции с героем",
    "subscribe": "Подписки...",
    "update_time": "Поменять время...",
    "show_data_profile": "Проверить данные профиля",
    "add_hero": "Добавить еще одного героя",
    "delete_hero": "Удалить одного героя",
    "rename_hero": "Переименовать героя",
    "unsubscribe_replace_kz": "Отписаться от напоминалки о смене КЗ за час",
    "subscribe_replace_kz": "Подписаться на напоминалку о смене КЗ за час",
    "unsubscribe_energy": "Отписаться от напоминалки по сбору энергии",
    "subscribe_energy": "Подписаться на напоминалку по сбору энергии",
    "unsubscribe_description_kz": "Отписаться от ежедневного описания КЗ",
    "subscribe_description_kz": "Подписаться на ежедневное описание КЗ",
    "update_time_replace_kz": "Поменять время смены КЗ",
    "update_time_energy": "Поменять время первого сбора энергии",
}

go_back = "🔙Назад🔙"
cancel = "❌Отмена❌"
